import streamlit as st

#st.sidebar.markdown("# Main page 🎈")

st.title('SmartCH4 Γραμμικός Προγραμματισμός')
"""
Εφαρμογή για τη βελτιστοποίηση κόστους παραγωγής μεθανίου με τη χρήση γραμμικού προγραμματισμού.
"""

st.header('Περιγραφή προβλήματος', divider='rainbow')

st.markdown("""
O γραμμικός προγραμματισμός είναι μια τεχνική για τον υπολογισμό της βέλτισης λύσης σε ένα πρόβλημα που μοντελοποιείται ως ένα σύνολο γραμμικών σχέσεων. 

Διαθέτουμε ένα σύνολο υποστρωμάτων **S<sub>i</sub>** (S1, S2, S3, ..) για την παραγωγή μεθανίου με τα παρακάτω χαρακτηριστικά:
- **B**: Δυναμικό παραγωγής μεθανίου (L<sub>CH4</sub>/KgVS)
- **W**: Μέγιστο διαθέσιμο βάρος (Kg)
- **C**: Κόστος ανά Kg (Euro/Kg)
- **D**: Απόσταση από τη μονάδα (Km). Η απόσταση επηρεάζει το κόστος μεταφοράς και επομένως το συνολικό κόστος. 

Το ζητούμενο είναι να βρεθεί η **βέλτιστη σύνθεση σε βάρος των υποστρωμάτων** **X<sub>i</sub>** (X1, X2, X3, ...) που θα ελαχιστοποιεί το συνολικό κόστος υποστρωμάτων **Κ** και θα πετυχαίνει τον στόχο παραγωγής μεθανίου **T** με απόκλιση +/- **e** %.

**Συνάρτηση κόστους K (objective function):**

Ελαχιστοποίησε το κόστος Κ. Το συνολικό κόστος ισούται με το κόστος αγοράς Kb συν το κόστος μεταφοράς Kt:

Kb = Σ(Ci * Xi)

Kt = Σ(Di * Xi) ???

=> Κ = Σ(Ci * Xi + Di * Xi)

**Υπό τους περιορισμούς (constraints):**

Το δυναμικό παραγωγής μεθανού πρέπει να είναι στο εύρος του στόχου:
            
- T*(1-e) <= Σ(Bi * Xi) <= T*(1+e)

Το συνολικό βάρος των υποστρωμάτων πρέπει να είναι μικρότερο ή ίσο του διαθέσιμου:

- 0 <= Xi <= Wi (Το διαθέσιμο βάρος κάθε υποστρώματος)

""", unsafe_allow_html=True,)