import streamlit as st

#st.sidebar.markdown("# Main page 🎈")


st.title('SmartCH4 - Γραμμική Βελτιστοποίηση')
"""
Εφαρμογή για τη βελτιστοποίηση τους κόστους / παραγωγής μεθανίου με τη χρήση αλγορίθμου γραμμικής βελτιστοποίσης.
Η **γραμμική βελτιστοποίηση** (γνωστό και ως *γραμμικός προγραμματισμός*) είναι μια τεχνική για τον υπολογισμό της βέλτισης λύσης σε ένα πρόβλημα που μοντελοποιείται ως ένα σύνολο γραμμικών σχέσεων. 

Στη σελίδα αυτή περιγράφουμε το πρόβλημα, για το εργαλείο βελτιστοποίησης κάντε κλικ στο μενού **Tool** αριστερά.
"""


st.header('Περιγραφή προβλήματος', divider='rainbow')

st.markdown("""
Διαθέτουμε ένα σύνολο αποβλήτων ή υποστρωμάτων **S<sub>i</sub>** (S1, S2, S3, ..) για την παραγωγή μεθανίου με τα παρακάτω χαρακτηριστικά:
- **B**: Δυναμικό παραγωγής μεθανίου (L<sub>CH4</sub>/KgVS)
- **W**: Μέγιστο διαθέσιμο βάρος (Kg)
- **C**: Κόστος ανά Kg (Euro/Kg)
- **D**: Απόσταση από τη μονάδα (Km). Η απόσταση επηρεάζει το κόστος μεταφοράς και επομένως το συνολικό κόστος. 

Το ζητούμενο είναι να βρεθεί η **βέλτιστη σύνθεση σε βάρος των υποστρωμάτων** **X<sub>i</sub>** (X1, X2, X3, ...) που θα ελαχιστοποιεί το συνολικό κόστος υποστρωμάτων **Κ** ενώ θα πετυχαίνει τον στόχο ημερίσιας παραγωγής μεθανίου **T** με μια απόκλιση +/- **e** %.
Θεωρούμε ότι το τελικό μίγμα θα τροφοδοτήσει τη μονάδα για 10 ημέρες.           

**Συνάρτηση κόστους K (objective function):**

Ελαχιστοποίησε το κόστος Κ. Το συνολικό κόστος ισούται με το κόστος αγοράς Kb συν το κόστος μεταφοράς Kt. Επομένως:
            
K = Kb + Kt

Kb = Σ(Ci * Xi), δηλαδή γραμμικά το επιμέρους κόστος αγορά κάθε υποστρώματος.

Kt = Σ(Di * Xi), δηλαδή γραμμικά ανάλογα με τα κιλά κάθε υποστρώματος. Αυτός φυσικά δεν είναι ο σωστότερος τρόπος υπολογισμού
αλλά προς το παρών το αφήνουμε έτσι. Κανονικά θα πρέπει να υπολογιστεί κλιμακωτά (π.χ. D=1 για τα πρώτα 1000 κιλά, κ.ο.κ.). Επίσης θα πρέπει να ληφθεί υπόψη ότι ένα φορτηγό μπορεί να προμηθευτεί σε ένα φορτία πολλά υποστρώματα.

Με τις παραδοχές καταλήγουμε στην απλή γραμμική σχέση:
            
Κ = Σ(Ci * Xi + Di * Xi) = Σ ((Ci+Di) * Xi)

**Υπό τους περιορισμούς (constraints):**

α) Η παραγωγή του μεθανίου πρέπει να είναι σε ένα εύρος του στόχου.
            
Επειδή αναζητούμε μια σύνθεση σε κιλά αποβλήτων πρέπει να ορίσουμε και τον αριθμό των ημερών που θα χρησιμοποιθούν για την παραγωγή.
Θεωρούμε ότι το τελικό μίγμα θα τροφοδοτήσει τη μονάδα για ένα συγκεκριμένο αριθμό ημερών (π.χ n=10). Επομένως η παραγωγή πρέπει να είναι στο εύρος:
            
n * T * (1-e) <= Σ(Bi * Xi) <= n * T * (1+e)
            
Υπενθυμίζουμε Τ είναι ο ημερίσιος στόχος παραγωγής μεθανίου και e η απόκλιση στόχου σε ποσοστό.

β) Το συνολικό βάρος των υποστρωμάτων πρέπει να είναι μικρότερο ή ίσο του διαθέσιμου:

0 <= Xi <= Wi (Το διαθέσιμο βάρος κάθε υποστρώματος)

""", unsafe_allow_html=True,)

st.subheader('Παράδειγμα')

"""
Αν θεωηρήσουμε δύο υποστρώματα τότε οι περιορισμοί για τις τιμές X1 και X2 φαίνονται στο παρακάτω διάγραμμα.
Η κόκκινη γραμμή εκφράζει τον περιορισμό παραγωγής μεθανίου, οι μαύρες γραμμές τον περιορισμό βάρους.
Το πεδίο τιμών είναι η περιοχή με τις διαγράμμιση.
"""

st.image('constraints-diagram.png', caption='Sunrise by the mountains')